#include <iostream>
#include <cstdlib>
#include <string>
#include <fstream>
using namespace std; //Владислав Євдокименко

class User {
private:
char choice;
string plan;
char consent;
void Vitannya (){
    cout<<"Вас вiтає  Pull-Up Trainer!\n\n";
   cout<<"Будь ласка, прочитайте iнструкцiю\nдля продовження натиснiть Enter...\n";
cin.get();
system("clear");
}
void Download ( string &text){
    cout<<"\nДобре, починаю запис у файл. . .\n";
    string file_name ="Tренувальний план.txt";
    ofstream file (file_name);
if (file.is_open()){
file<<text;
file.close();
cout<< "\nТекстовий файл з розкладом тренувань успiшно сформован!\n\n";
}
else{
    cout<<"Фатальна помилка запису файла.....\n";
}

}
void Save(){
    cout<< "Чи потрiбно зберегти цей план у текстовому файлi?\n";
    cout<<"так[введiть Y] нi[введiть N]\n";
    cin>>consent;
    if(consent == 'y'|| consent == 'Y' ){
    Download(plan);
    } 
    else if(consent == 'n'|| consent == 'N'){
       cout<< "\nПрийнято! Текстовий файл не потрiбний.\n\n";
    }
    else{
        cout<< "Введений символ неправильний. Можливо, використовується не той алфавiт. Будь ласка, спробуйте ще раз.\n" ;
        Save();
    }
}
void TRENNY() {
   short int kilkist; 
   
   cout<<"Будь ласка, введiть вашу максимальну кiлькiсть повторiв за один пiдхiд (вiд 1 до 12): ";
   cin>>kilkist;
   switch(kilkist)
   {
    case  1:
    cin.get();
    system("clear");
    plan= "Програма тренувань для 1 повторення \n\n"
    "ПЕРШИЙ ТИЖДЕНЬ\n"
    "Понедiлок: заднiй хват 3 пiдходiв по 2 рази \n"
    "Четвер: переднiй хват – 1 пiдхiд 1 раз, заднiй хват – 2 пiдходи по 2 рази.\n\n"

    "ДРУГИЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 4 пiдходи по 2 рази.\n"
    "Середа: переднiй хват – 1 пiдхiд 1 раз, заднiй хват – 2 пiдходи по 2 рази.\n"
    "П'ятниця: заднiй хват – 5 пiдходiв по 2 рази.\n\n"
 
    "ТРЕТIЙ ТИЖДЕНЬ \n"
    "Понедiлок: переднiй хват – 1 пiдхiд 1 раз, заднiй хват – 4 пiдходи по 2 рази.\n"
    "Середа: переднiй хват – 1 пiдхiд 1 раз, заднiй хват – 2 пiдходи по 2 рази.\n"
    "П'ятниця: заднiй хват – 4 пiдходи по 2 рази.\n \n"

    "ЧЕТВЕРТИЙ ТИЖДЕНЬ \n"
    "Понедiлок: переднiй хват – 1 пiдхiд 2 рази, заднiй хват – 2 пiдходи по 2 рази.\n"
    "Четвер: заднiй хват – 4 пiдходи по 3 рази.\n\n"
    
    "П'ЯТИЙ ТИЖДЕНЬ \n"
    "Понедiлок: переднiй хват – 2 пiдходи по 1 разу, заднiй хват – 4 пiдходи по 2 рази.\n"
    "Четвер: переднiй хват – 3 пiдходи по 1 разу, заднiй хват – 4 пiдходи по 4 рази.\n\n"
    "Головне – регулярнiсть та терпiння!!!\n\n";
    cout<< plan;
    
    Save();
    cin.get();
    cout << "Натиснiть Enter, щоб вийти з програми.\n\n";
    cin.get();
    break;

    case  2:
    cin.get();
    system("clear");
    plan= "Програма тренувань для 2 повторень:\n \n"

    "ПЕРШИЙ ТИЖДЕНЬ\n"
    "Понедiлок : заднiй хват – 3 пiдходи по 2 рази.\n"
    "Четвер:переднiй хват – 1 пiдхiд 2 рази, заднiй хват – 2 пiдходи по 2 рази \n\n"

    "ДРУГИЙ ТИЖДЕНЬ \n"
    "Вiвторок: переднiй хват – 2 пiдходи по 2 рази, заднiй хват – 2 пiдходи по 2 рази. \n"
    "Четвер: заднiй хват – 4 пiдходи по 2 рази.\n"
    "Субота: переднiй хват – 1 пiдхiд 2 рази, заднiй хват – 3 пiдходи по 2 рази.\n\n"
 

    "ТРЕТIЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 5 пiдходiв по 2 рази. \n"
    "Середа: переднiй хват – 2 пiдходи по 2 рази, заднiй хват – 3 пiдходи по 2 рази.\n"
    "П’ятниця: переднiй хват – 1 пiдхiд 2 рази, заднiй хват – 4 пiдходи по 3 рази.\n \n"

    "ЧЕТВЕРТИЙ ТИЖДЕНЬ \n"
    "Вiвторок: заднiй хват – 3 пiдходи по 3 рази. \n"
    "Четвер: переднiй хват – 2 пiдходи по 2 рази, заднiй хват – 4 пiдходи по 3 рази. \n"
    "Субота: переднiй хват – 1 пiдхiд 3 рази, заднiй хват – 5 пiдходiв по 3 рази. \n\n"

    "П'ЯТИЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 4 пiдходи по 3 рази. \n"
    "Середа: переднiй хват – 2 пiдходи по 2 рази, заднiй хват – 5 пiдходiв по 3 рази. \n"
    "П’ятниця: переднiй хват – 3 пiдходи по 2 рази, заднiй хват – 5 пiдходiв по 4 рази. \n\n"
    "Головне – регулярнiсть та терпiння!!!\n\n";
    
    cout<< plan;
    
    Save();
    cin.get();
    cout << "Натиснiть Enter, щоб вийти з програми.\n\n";
    cin.get();
    break;

    case  3:
    cin.get();
    system("clear");
    plan= "Програма тренувань для 3 повторень: \n\n"
    "ПЕРШИЙ ТИЖДЕНЬ\n"
    "Понедiлок: заднiй хват – 3 пiдходи по 3 рази.\n"
    "Середа: переднiй хват – 1 пiдхiд 3 рази, заднiй хват – 2 пiдходи по 3 рази.\n"
    "П’ятниця: заднiй хват – 4 пiдходи по 3 рази. \n\n"

    "ДРУГИЙ ТИЖДЕНЬ \n"
    "Вiвторок: переднiй хват – 2 пiдходи по 3 рази, заднiй хват – 2 пiдходи по 3 рази. \n"
    "Четвер: заднiй хват – 4 пiдходи по 3 рази.\n"
    "Субота: переднiй хват – 1 пiдхiд 3 рази, заднiй хват – 3 пiдходи по 3 рази. \n\n"
  
    "ТРЕТIЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 5 пiдходiв по 3 рази. \n"
    "Середа: переднiй хват – 2 пiдходи по 3 рази, заднiй хват – 3 пiдходи по 3 рази.\n"
    "П’ятниця: переднiй хват – 1 пiдхiд 3 рази, заднiй хват – 4 пiдходи по 4 рази.\n\n"

    "ЧЕТВЕРТИЙ ТИЖДЕНЬ \n"
    "Вiвторок: заднiй хват – 3 пiдходи по 4 рази. \n"
    "Четвер: переднiй хват – 2 пiдходи по 3 рази, заднiй хват – 4 пiдходи по 4 рази.\n"
    "Субота: переднiй хват – 1 пiдхiд 4 рази, заднiй хват – 5 пiдходiв по 4 рази. \n\n"

    "П'ЯТИЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 4 пiдходи по 4 рази. \n"
    "Середа: переднiй хват – 2 пiдходи по 3 рази, заднiй хват – 5 пiдходiв по 4 рази.\n"
    "П’ятниця: переднiй хват – 3 пiдходи по 3 рази, заднiй хват – 5 пiдходiв по 5 разiв.\n\n"
    "Головне – регулярнiсть та терпiння!!!\n\n";
    cout<< plan;
    
    Save();
    cin.get();
    cout << "Натиснiть Enter, щоб вийти з програми.\n\n";
    cin.get();
    break;
    case  4:
    cin.get();
    system("clear");
    plan= "Програма тренувань для 4 повторень:\n \n"
    "ПЕРШИЙ ТИЖДЕНЬ\n"
    "Понедiлок: заднiй хват – 3 пiдходи по 4 рази. \n"
    "Середа: переднiй хват – 1 пiдхiд 4 рази, заднiй хват – 2 пiдходи по 4 рази.\n"
    "П’ятниця: заднiй хват – 4 пiдходи по 4 рази.\n\n"

    "ДРУГИЙ ТИЖДЕНЬ \n"
    "Вiвторок: переднiй хват – 2 пiдходи по 4 рази, заднiй хват – 2 пiдходи по 4 рази. \n"
    "Четвер: заднiй хват – 4 пiдходи по 4 рази.\n"
    "Субота: переднiй хват – 1 пiдхiд 4 рази, заднiй хват – 3 пiдходи по 4 рази. \n\n"

    "ТРЕТIЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 5 пiдходiв по 4 рази. \n"
    "Середа: переднiй хват – 2 пiдходи по 4 рази, заднiй хват – 3 пiдходи по 4 рази.\n"
    "П’ятниця: переднiй хват – 1 пiдхiд 4 рази, заднiй хват – 4 пiдходи по 5 разiв. \n\n"

    "ЧЕТВЕРТИЙ ТИЖДЕНЬ \n"
    "Вiвторок: заднiй хват – 3 пiдходи по 5 разiв. \n"
    "Четвер: переднiй хват – 2 пiдходи по 4 рази, заднiй хват – 4 пiдходи по 5 разiв.\n"
    "Субота: переднiй хват – 1 пiдхiд 5 разiв, заднiй хват – 5 пiдходiв по 5 разiв.\n\n"

    "П'ЯТИЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 4 пiдходи по 5 разiв. \n"
    "Середа: переднiй хват – 2 пiдходи по 4 рази, заднiй хват – 5 пiдходiв по 5 разiв.\n"
    "П’ятниця: переднiй хват – 3 пiдходи по 4 рази, заднiй хват – 5 пiдходiв по 6 разiв. \n\n"
    "Головне – регулярнiсть та терпiння!!!\n\n";
    cout<< plan;
    
    Save();
    cin.get();
    cout << "Натиснiть Enter, щоб вийти з програми.\n\n";
    cin.get();
    break;
    case 5 :
    cin.get();
    system("clear");
    plan= "Програма тренувань для 5 повторень: \n\n"
    "ПЕРШИЙ ТИЖДЕНЬ\n"
    "Понедiлок: заднiй хват – 3 пiдходи по 5 разiв. \n"
    "Середа: переднiй хват – 1 пiдхiд 5 разiв, заднiй хват – 2 пiдходи по 5 разiв.\n"
    "П’ятниця: заднiй хват – 4 пiдходи по 5 разiв. \n\n"

    "ДРУГИЙ ТИЖДЕНЬ \n"
    "Вiвторок: переднiй хват – 2 пiдходи по 5 разiв, заднiй хват – 2 пiдходи по 5 разiв. \n"
    "Четвер: заднiй хват – 4 пiдходи по 5 разiв.\n"
    "Субота: переднiй хват – 1 пiдхiд 5 разiв, заднiй хват – 3 пiдходи по 5 разiв. \n\n"
   
    "ТРЕТIЙ ТИЖДЕНЬ \n"
    "Вiвторок: заднiй хват – 3 пiдходи по 6 разiв. \n"
    "Середа: переднiй хват – 2 пiдходи по 5 разiв, заднiй хват – 3 пiдходи по 5 разiв.\n"
    "П’ятниця: переднiй хват – 1 пiдхiд 5 разiв, заднiй хват – 4 пiдходи по 6 разiв. \n\n"

    "ЧЕТВЕРТИЙ ТИЖДЕНЬ \n"
    "Вiвторок: заднiй хват – 3 пiдходи по 6 разiв. \n"
    "Четвер: переднiй хват – 2 пiдходи по 5 разiв, заднiй хват – 4 пiдходи по 6 разiв.\n"
    "Субота: переднiй хват – 1 пiдхiд 6 разiв, заднiй хват – 5 пiдходiв по 6 разiв. \n\n"

    "П'ЯТИЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 4 пiдходи по 6 разiв. \n"
    "Середа: переднiй хват – 2 пiдходи по 5 разiв, заднiй хват – 5 пiдходiв по 6 разiв\n"
    "П’ятниця: переднiй хват – 3 пiдходи по 5 разiв, заднiй хват – 5 пiдходiв по 7 разiв. \n\n"
    "Головне – регулярнiсть та терпiння!!!\n\n";
    cout<< plan;
    
    Save();
    cin.get();
    cout << "Натиснiть Enter, щоб вийти з програми.\n\n";
    cin.get();
   
    break;
    case 6 :
    cin.get();
    system("clear");
    plan= "Програма тренувань для 6 повторень: \n\n"
    "ПЕРШИЙ ТИЖДЕНЬ\n"
    "Понедiлок: заднiй хват – 3 пiдходи по 6 разiв. \n"
    "Середа: переднiй хват – 1 пiдхiд 6 разiв, заднiй хват – 2 пiдходи по 6 разiв.\n"
    "П’ятниця: заднiй хват – 4 пiдходи по 6 разiв. \n\n"

    "ДРУГИЙ ТИЖДЕНЬ \n"
    "Вiвторок: переднiй хват – 2 пiдходи по 6 разiв, заднiй хват – 2 пiдходи по 6 разiв. \n"
    "Четвер: заднiй хват – 4 пiдходи по 6 разiв.\n"
    "Субота: переднiй хват – 1 пiдхiд 6 разiв, заднiй хват – 3 пiдходи по 6 разiв. \n\n"
    
    "ТРЕТIЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 5 пiдходiв по 6 разiв.\n"
    "Середа: переднiй хват – 2 пiдходи по 6 разiв, заднiй хват – 3 пiдходи по 6 разiв.\n"
    "П’ятниця: переднiй хват – 1 пiдхiд 6 разiв, заднiй хват – 4 пiдходи по 7 разiв.\n\n"

    "ЧЕТВЕРТИЙ ТИЖДЕНЬ \n"
    "Вiвторок: заднiй хват – 3 пiдходи по 7 разiв.\n"
    "Четвер: переднiй хват – 2 пiдходи по 6 разiв, заднiй хват – 4 пiдходи по 7 разiв.\n"
    "Субота: переднiй хват – 1 пiдхiд 7 разiв, заднiй хват – 5 пiдходiв по 7 разiв.\n\n"

    "П'ЯТИЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 4 пiдходи по 7 разiв. \n"
    "Середа: переднiй хват – 2 пiдходи по 6 разiв, заднiй хват – 5 пiдходiв по 7 разiв.\n"
    "П’ятниця: переднiй хват – 3 пiдходи по 6 разiв, заднiй хват – 5 пiдходiв по 8 разiв.\n\n"
    "Головне – регулярнiсть та терпiння!!!\n\n";
    cout<< plan;
    
    Save();
    cin.get();
    cout << "Натиснiть Enter, щоб вийти з програми.\n\n";
    cin.get();
    break;
    case  7:
    cin.get();
    system("clear");
    plan= "Програма тренувань для 7 повторень: \n\n"
    "ПЕРШИЙ ТИЖДЕНЬ\n"
    "Понедiлок: заднiй хват – 3 пiдходи по 7 разiв. \n"
    "Середа: переднiй хват – 1 пiдхiд 7 разiв, заднiй хват – 2 пiдходи по 7 разiв.\n"
    "П’ятниця: заднiй хват – 4 пiдходи по 7 разiв. \n\n"
    
    "ДРУГИЙ ТИЖДЕНЬ \n"
    "Вiвторок: переднiй хват – 2 пiдходи по 7 разiв, заднiй хват – 2 пiдходи по 7 разiв. \n"
    "Четвер: заднiй хват – 4 пiдходи по 7 разiв.\n"
    "Субота: переднiй хват – 1 пiдхiд 7 разiв, заднiй хват – 3 пiдходи по 7 разiв. \n\n"
  
    "ТРЕТIЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 5 пiдходiв по 7 разiв. \n"
    "Середа: переднiй хват – 2 пiдходи по 7 разiв, заднiй хват – 3 пiдходи по 7 разiв.\n"
    "П’ятниця: переднiй хват – 1 пiдхiд 7 разiв, заднiй хват – 4 пiдходи по 8 разiв.\n\n"

    "ЧЕТВЕРТИЙ ТИЖДЕНЬ \n"
    "Вiвторок: заднiй хват – 3 пiдходи по 8 разiв.\n"
    "Четвер: переднiй хват – 2 пiдходи по 7 разiв, заднiй хват – 4 пiдходи по 8 разiв.\n"
    "убота: переднiй хват – 1 пiдхiд 8 разiв, заднiй хват – 5 пiдходiв по 8 разiв. \n\n"

    "П'ЯТИЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 4 пiдходи по 8 разiв.\n"
    "Середа: переднiй хват – 2 пiдходи по 7 разiв, заднiй хват – 5 пiдходiв по 8 разiв.\n"
    "П’ятниця: переднiй хват – 3 пiдходи по 7 разiв, заднiй хват – 5 пiдходiв по 9 разiв.\n\n"
    "Головне – регулярнiсть та терпiння!!!\n\n";
    cout<< plan;
    
    Save();
    cin.get();
    cout << "Натиснiть Enter, щоб вийти з програми.\n\n";
    cin.get();
    break;
    case 8:
    cin.get();
    system("clear");
    plan="Програма тренувань для 8 повторень: \n\n"
    "ПЕРШИЙ ТИЖДЕНЬ\n"
    "Понедiлок: заднiй хват – 3 пiдходи по 8 разiв. \n"
    "Середа: переднiй хват – 1 пiдхiд 8 разiв, заднiй хват – 2 пiдходи по 8 разiв.\n"
    "П’ятниця: заднiй хват – 4 пiдходи по 8 разiв.\n\n"

    "ДРУГИЙ ТИЖДЕНЬ \n"
    "Вiвторок: переднiй хват – 2 пiдходи по 8 разiв, заднiй хват – 2 пiдходи по 8 разiв. \n"
    "Четвер: заднiй хват – 4 пiдходи по 8 разiв.\n"
    "Субота: переднiй хват – 1 пiдхiд 8 разiв, заднiй хват – 3 пiдходи по 8 разiв.\n \n"

    "ТРЕТIЙ ТИЖДЕНЬ \n"

    "Понедiлок: заднiй хват – 5 пiдходiв по 8 разiв. \n"
    "Середа: переднiй хват – 2 пiдходи по 8 разiв, заднiй хват – 3 пiдходи по 8 разiв.\n"
    "П’ятниця: переднiй хват – 1 пiдхiд 8 разiв, заднiй хват – 4 пiдходи по 9 разiв.\n \n"
    "ЧЕТВЕРТИЙ ТИЖДЕНЬ \n"

    "Вiвторок: заднiй хват – 3 пiдходи по 9 разiв. \n"
    "Четвер: переднiй хват – 2 пiдходи по 8 разiв, заднiй хват – 4 пiдходи по 9 разiв.\n"
    "Субота: переднiй хват – 1 пiдхiд 9 разiв, заднiй хват – 5 пiдходiв по 9 разiв.\n\n"

    "П'ЯТИЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 4 пiдходи по 9 разiв. \n"
    "Середа: переднiй хват – 2 пiдходи по 8 разiв, заднiй хват – 5 пiдходiв по 9 разiв.\n"
    "П’ятниця: переднiй хват – 3 пiдходи по 8 разiв, заднiй хват – 5 пiдходiв по 10 разiв.\n\n"
    "Головне – регулярнiсть та терпiння!!!\n\n";
    cout<< plan;
    
    Save();
    cin.get();
    cout << "Натиснiть Enter, щоб вийти з програми.\n\n";
    cin.get();
    break;
    case 9:
    cin.get();
    system("clear");
    plan= "Програма тренувань для 9 повторень: \n\n"
    "ПЕРШИЙ ТИЖДЕНЬ\n"
    "Понедiлок: заднiй хват – 3 пiдходи по 9 разiв. \n"
    "Середа: переднiй хват – 1 пiдхiд 9 разiв, заднiй хват – 2 пiдходи по 9 разiв.\n"
    "П’ятниця: заднiй хват – 4 пiдходи по 9 разiв. \n\n"

    "ДРУГИЙ ТИЖДЕНЬ \n"
    "Вiвторок: переднiй хват – 2 пiдходи по 9 разiв, заднiй хват – 2 пiдходи по 9 разiв. \n"
    "Четвер: заднiй хват – 4 пiдходи по 9 разiв.\n"
    "Субота: переднiй хват – 1 пiдхiд 9 разiв, заднiй хват – 3 пiдходи по 9 разiв.\n \n"
  
    "ТРЕТIЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 5 пiдходiв по 9 разiв. \n"
    "Середа: переднiй хват – 2 пiдходи по 9 разiв, заднiй хват – 3 пiдходи по 9 разiв.\n"
    "П’ятниця: переднiй хват – 1 пiдхiд 9 разiв, заднiй хват – 4 пiдходи по 10 разiв.\n \n"

    "ЧЕТВЕРТИЙ ТИЖДЕНЬ \n"
    "Вiвторок: заднiй хват – 3 пiдходи по 10 разiв. \n"
    "Четвер: переднiй хват – 2 пiдходи по 9 разiв, заднiй хват – 4 пiдходи по 10 разiв.\n"
    "Субота: переднiй хват – 1 пiдхiд 10 разiв, заднiй хват – 5 пiдходiв по 10 разiв.\n\n"

    "П'ЯТИЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 4 пiдходи по 10 разiв. \n"
    "Середа: переднiй хват – 2 пiдходи по 9 разiв, заднiй хват – 5 пiдходiв по 10 разiв.\n"
    "П’ятниця: переднiй хват – 3 пiдходи по 9 разiв, заднiй хват – 5 пiдходiв по 11 разiв. \n\n"
    "Головне – регулярнiсть та терпiння!!!\n\n";
    cout<< plan;
    
    Save();
    cin.get();
    cout << "Натиснiть Enter, щоб вийти з програми.\n\n";
    cin.get();
    break;
    case 10:
    cin.get();
    system("clear");
    plan= "Програма тренувань для 10 повторень:\n \n"
    "ПЕРШИЙ ТИЖДЕНЬ\n"
    "Понедiлок: заднiй хват – 3 пiдходи по 10 разiв. \n"
    "Середа: переднiй хват – 1 пiдхiд 10 разiв, заднiй хват – 2 пiдходи по 10 разiв.\n"
    "П’ятниця: заднiй хват – 4 пiдходи по 10 разiв. \n\n"

    "ДРУГИЙ ТИЖДЕНЬ \n"
    "Вiвторок: переднiй хват – 2 пiдходи по 10 разiв, заднiй хват – 2 пiдходи по 10 разiв. \n"
    "Четвер: заднiй хват – 4 пiдходи по 10 разiв.\n"
    "Субота: переднiй хват – 1 пiдхiд 10 разiв, заднiй хват – 3 пiдходи по 10 разiв.\n \n"
   
    "ТРЕТIЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 5 пiдходiв по 10 разiв. \n"
    "Середа: переднiй хват – 2 пiдходи по 10 разiв, заднiй хват – 3 пiдходи по 10 разiв.\n"
    "П’ятниця: переднiй хват – 1 пiдхiд 10 разiв, заднiй хват – 4 пiдходи по 11 разiв. \n\n"

    "ЧЕТВЕРТИЙ ТИЖДЕНЬ \n"
    "Вiвторок: заднiй хват – 3 пiдходи по 11 разiв. \n"
    "Четвер: переднiй хват – 2 пiдходи по 10 разiв, заднiй хват – 4 пiдходи по 11 разiв.\n"
    "Субота: переднiй хват – 1 пiдхiд 11 разiв, заднiй хват – 5 пiдходiв по 11 разiв.\n \n"

    "П'ЯТИЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 4 пiдходи по 11 разiв. \n"
    "Середа: переднiй хват – 2 пiдходи по 10 разiв, заднiй хват – 5 пiдходiв по 11 разiв.\n"
    "П’ятниця: переднiй хват – 3 пiдходи по 10 разiв, заднiй хват – 5 пiдходiв по 12 разiв. \n\n"
    "Головне – регулярнiсть та терпiння!!!\n\n";
    cout<< plan;
    
    Save();
    cin.get();
    cout << "Натиснiть Enter, щоб вийти з програми.\n\n";
    cin.get();
    break;
    case 11:
    cin.get();
    system("clear");
    plan= "Програма тренувань для 11 повторень: \n"
    "ПЕРШИЙ ТИЖДЕНЬ\n"
    "Понедiлок: заднiй хват – 3 пiдходи по 11 разiв. \n"
    "Середа: переднiй хват – 1 пiдхiд 11 разiв, заднiй хват – 2 пiдходи по 11 разiв.\n"
    "П’ятниця: заднiй хват – 4 пiдходи по 11 разiв.\n\n"

    "ДРУГИЙ ТИЖДЕНЬ \n"
    "Вiвторок: переднiй хват – 2 пiдходи по 11 разiв, заднiй хват – 2 пiдходи по 11 разiв. \n"
    "Четвер: заднiй хват – 4 пiдходи по 11 разiв.\n"
    "Субота: переднiй хват – 1 пiдхiд 11 разiв, заднiй хват – 3 пiдходи по 11 разiв.\n\n"

    "ТРЕТIЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 5 пiдходiв по 11 разiв.\n"
    "Середа: переднiй хват – 2 пiдходи по 11 разiв, заднiй хват – 3 пiдходи по 11 разiв.\n"
    "П’ятниця: переднiй хват – 1 пiдхiд 11 разiв, заднiй хват – 4 пiдходи по 12 разiв. \n\n"

    "ЧЕТВЕРТИЙ ТИЖДЕНЬ \n"
    "Вiвторок: заднiй хват – 3 пiдходи по 12 разiв. \n"
    "Четвер: переднiй хват – 2 пiдходи по 11 разiв, заднiй хват – 4 пiдходи по 12 разiв.\n"
    "Субота: переднiй хват – 1 пiдхiд 12 разiв, заднiй хват – 5 пiдходiв по 12 разiв. \n"

    "П'ЯТИЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 4 пiдходи по 12 разiв. \n"
    "Середа: переднiй хват – 2 пiдходи по 11 разiв, заднiй хват – 5 пiдходiв по 12 разiв.\n"
    "П’ятниця: переднiй хват – 3 пiдходи по 11 разiв, заднiй хват – 5 пiдходiв по 12 разiв.\n\n"
    "Головне – регулярнiсть та терпiння!!!\n\n";
    cout<< plan;
    
    Save();
    cin.get();
    cout << "Натиснiть Enter, щоб вийти з програми.\n\n";
    cin.get();
    break;
    case 12 :
    cin.get();
    system("clear");
    plan= "Програма тренувань для 12 повторень: \n\n"
    "ПЕРШИЙ ТИЖДЕНЬ\n"
    "Понедiлок: заднiй хват – 3 пiдходи по 12 разiв. \n"
    "Середа: переднiй хват – 1 пiдхiд 12 разiв, заднiй хват – 2 пiдходи по 12 разiв.\n"
    "П’ятниця: заднiй хват – 4 пiдходи по 12 разiв.\n\n"

    "ДРУГИЙ ТИЖДЕНЬ \n"
    "Вiвторок: переднiй хват – 2 пiдходи по 12 разiв, заднiй хват – 2 пiдходи по 12 разiв.\n"
    "Четвер: заднiй хват – 4 пiдходи по 12 разiв.\n"
    "Субота: переднiй хват – 1 пiдхiд 12 разiв, заднiй хват – 3 пiдходи по 12 разiв.\n\n"

 
    "ТРЕТIЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 5 пiдходiв по 12 разiв. \n"
    "Середа: переднiй хват – 2 пiдходи по 12 разiв, заднiй хват – 3 пiдходи по 12 разiв.\n"
    "П’ятниця: переднiй хват – 1 пiдхiд 12 разiв, заднiй хват – 4 пiдходи по 13 разiв.\n\n"

    "ЧЕТВЕРТИЙ ТИЖДЕНЬ \n"
    "Вiвторок: заднiй хват – 3 пiдходи по 13 разiв.\n"
    "Четвер: переднiй хват – 2 пiдходи по 12 разiв, заднiй хват – 4 пiдходи по 13 разiв.\n"
    "Субота: переднiй хват – 1 пiдхiд 13 разiв, заднiй хват – 5 пiдходiв по 13 разiв.\n\n"

    "П'ЯТИЙ ТИЖДЕНЬ \n"
    "Понедiлок: заднiй хват – 4 пiдходи по 13 разiв.\n"
    "Середа: переднiй хват – 2 пiдходи по 12 разiв, заднiй хват – 5 пiдходiв по 13 разiв.\n"
    "П’ятниця: переднiй хват – 3 пiдходи по 12 разiв, заднiй хват – 5 пiдходiв по 14 разiв.\n\n"
    "Головне – регулярнiсть та терпiння!!!\n\n";
    cout<< plan;
    
    Save();
    cin.get();
    cout << "Натиснiть Enter, щоб вийти з програми.\n\n";
    cin.get();
    break;
       
       default:
       cin.get();
       
        cout <<"Число повторiв не входить до цiльової. будь ласка, повторiть спробу\n";
        cout<< "Натиснiть Enter щоб повторити операцiю\n";
         cin.get();
         system("clear");
         TRENNY();
   }
   
}
void Guide (){
   
   cout<<"\t\t\t IНСТРУКЦIЯ\n";
   cout<<"\t ВСТУП\n";
   cout<<"Цей застосунок призначений для початкiвцiв, якi можуть виконати вiд одного до 12 пiдтягувань,та\n";
   cout<<"прагнуть поступово покращити свої результати. Використовуючи науково обґрунтованi методи тренувань,\n";
   cout<<"заснованi на принципах перiодизацiї, прогресивного навантаження та бiомеханiчного аналiзу, дана\n";
   cout<<"програма дозволяє за один тренувальний цикл (5 тижнiв) збiльшити кiлькiсть пiдтягувань на 1-5 повторень:.\n";
   cout<<"Пiсля завершення циклу користувач здiйснює повторний замiр максимального числа пiдтягувань i розпочинає \n ";
   cout<<"новий цикл з оновленими показниками. Програма може бути успiшно iнтегрована з iншими видами фiзичної \n";
   cout<<"активностi для комплексного розвитку фiзичних можливостей, сприяючи активному способу життя.\n\n";
   
   cout<<"\t0) ВИДИ ПIДТЯГУВАНЬ:\n";
   cout<<"Прямий хват (долонi зверненi вiд себе) – класичний варiант, що найбiльше залучає широчнi м’язи спини.  \n";
   cout<<"Зворотний хват (долонi зверненi до себе) – пiдвищує навантаження на бiцепси та нижню частину широчних м’язiв.\n\n";

   cout<<"\t1) ПОЧАТКОВЕ ПОЛОЖЕННЯ ПIД ЧАС ПIДТЯГУВАНЬ:\n";
   cout<<"Вiзьмiться за перекладину вибраним хватом (ширина плечей або трохи ширше для прямого хвату, вужче для зворотного). \n";
   cout<<"Повнiстю випрямiть руки та напружте плечi, щоб уникнути пасивного висiння.  \n";
   cout<<"Тiло має бути рiвним, ноги можна схрестити або залишити прямими.  \n";
   cout<<"Напружте м’язи кора для стабiлiзацiї корпусу.  \n\n";

   cout<<"\t2) ПIДЙОМ (концентрична фаза): \n";
   cout<<"Починайте рух, пiдтягуючи тiло вгору за рахунок сили спини та рук.  \n";
   cout<<"Намагайтеся не розгойдуватися, щоб уникнути iнерцiйних рухiв.  \n";
   cout<<"Пiднiмайтеся, доки пiдборiддя не опиниться вище перекладини.  \n";
   cout<<"Робiть вдих перед пiдйомом i видих пiд час найважчої частини руху.  \n";
   cout<<"При зворотному хватi бiльше акцентуйте рух на бiцепсах.  \n";
   cout<<"При прямому хватi тягнiться грудьми до перекладини, щоб активувати верхню частину спини.\n\n";

   cout<<"\t3) ОПУСКАННЯ (ексцентрична фаза): \n";
   cout<<"Контрольовано опускайтеся вниз до повного розпрямлення рук. \n";
   cout<<"Не падайте рiзко – контрольований рух дозволяє уникнути травм i покращує м’язову витривалiсть.  \n";
   cout<<"Витрачайте не менше 2-3 секунд на опускання, щоб пiдвищити ефективнiсть тренування. \n";
   cout<<"Залишайте спину прямою i контролюйте кожен етап руху.  \n";
   cout<<"При виконаннi зворотного хвату уникайте надмiрного напруження зап’ясть. \n\n";

   cout<<"\t4) ЗАГАЛЬНI ПОРАДИ:  \n";
   cout<<"Перед тренуванням виконуйте розминку для розiгрiву м’язiв та суглобiв.  \n";
   cout<<"Пiсля тренування робiть розтяжку для зменшення напруги та полiпшення гнучкостi. \n";
   cout<<"Дотримуйтеся плану тренувань та поступово збiльшуйте навантаження. \n";
   cout<<"Вiдпочивайте мiж пiдходами 30-90 секунд, залежно вiд рiвня пiдготовки. \n";
   cout<<"Контролюйте рацiон: бiлково-вуглеводний баланс впливає на вiдновлення та рiст м’язiв. \n";
   cout<<"Тримайте корпус напруженим i не прогинайтеся в попереку.  \n";
   cout<<"Уникайте використання iмпульсу – пiдтягування мають бути виконанi за рахунок сили м’язiв.  \n";
   cout<<"Виконуйте рух у повному дiапазонi для максимального ефекту. \n";
   cout<<"Дихайте рiвномiрно: видих при пiдйомi, вдих при опусканнi.\n";
   cout<<"Використовуйте рiзнi хвати (широкий, середнiй, вузький) для активацiї рiзних м’язових груп.  \n";
   cout<<"Чергуйте пiдтягування з iншими вправами для гармонiйного розвитку. \n\n";

   cout<<"\tПОШИРЕНI ПОМИЛКИ!!! \n";
   cout<<"Розгойдування тiла та використання iнерцiї.  \n";
   cout<<"Неповне розпрямлення рук у нижнiй точцi.  \n";
   cout<<"Недостатня амплiтуда (пiдборiддя не проходить перекладину).  \n";
   cout<<"Неправильне дихання або його затримка. \n";
   cout<<"Перевантаження передплiч, що може призвести до перевтоми. \n";
   cout<<"Використання надмiрного нахилу голови, що пiдвищує навантаження на шийний вiддiл.  \n";
   cout<<"Надмiрне напруження бiцепсiв при зворотному хватi. \n\n";


   cout<<"\tБIОМЕХАНIЧНI АСПЕКТИ ПIДТЯГУВАНЬ  \n";
   cout<<"Основнi працюючi м’язи: широчнi м’язи спини, ромбоподiбнi м’язи, бiцепси, заднi дельти.  \n";
   cout<<"Додаткове навантаження при зворотному хватi: бiцепс плеча, плече-променевий м’яз.  \n";
   cout<<"Пiдключення стабiлiзаторiв: м’язи кора (прес, поперек), передплiччя.  \n";
   cout<<"Ексцентричне навантаження пiд час опускання сприяє розвитку сили та м’язового контролю. \n";
   cout<<"Використання принципу перiодизацiї: чергування днiв навантаження та вiдпочинку для оптимального прогресу.  \n";
   cout<<"Вплив ширини хвата: широкий хват активує верхню частину спини, вузький – бiльше залучає бiцепси. \n";
   cout<<"\n\t\t\tДля продовження натиснiть Enter.";
   cin.get();
   cin.get();
system("clear");
   TRENNY();
}
void Choice(char& choice) {
   cout<< "Хочете прочитати iнструкцiю?\nтак[введiть Y] нi[введiть N]\n";
   cin>> choice;
   if (choice =='Y'|| choice == 'y') {
  system("clear");
   Guide ();
   }
   else if(choice == 'N'|| choice == 'n'){
        system("clear");
        TRENNY();
   }
   else {
       cout<<"помилка! Будь ласка, перевiрте розкладку на клавiатурi та введiть дiйсне значення!";
        Choice(choice);
   }
} 

public:
User(){
    Vitannya();
    
    Choice(choice);
}

};

int main()
{
system("clear");
setlocale(LC_ALL, "uk_UA.utf8");
User user;

    return 0;
}